//Завантаження даних - Відобразити статус Завантаження
//Відображення даних які ми завантажили(і конвертація даних)
//Якщо є помилка - виводимо статус помилки

export class List {
  STATE = {
    LOADING: 'loading',
    SUCCESS: 'success',
    ERROR: 'error',
  }

  status = null //властивість, яка буде мати один з трьох значень статусів
  data = null //дані, які ми завантажили
  element = null // елемент в якому ми будемо відображати наші дані

  //функція яка відповідає за прийняття статусу() і дані які треба занести

  updateStatus = (status, data) => {
    this.status = status //змінюємо статус

    if (data) this.data = data // якщо є дані то змінюємо дані

    this.updateView() //функція яка оновлює відображення зовнішній вигляд модуля
  }

  updateView = () => {}

  loadData = async () => {}

  convertData = () => {}
}
